[Language]
Main_Title=Bedankt voor het gebruiken van EaseUS Data Recovery Wizard
Sub_Title=Wat voor cijfer zou je ons geven?
Terrible=Verschrikkelijk
Poor=Slecht
Good=Goed
Great=Geweldig
Excellent=Uitstekend
Never_Ask_Again=Niet nog eens vragen
Rate_Now=Beoordeling versturen
Feedback_Text_Tips=Schrijf a.u.b. in minder dan 500 woorden waarom je deze beoordeling geeft.
Feedback_Length_Tips=Je hebt meer dan 500 woorden getypt, verstuur je bericht a.u.b. naar support@easeus.com.
